Chapter improvements
